SiliconLabs/wfx-fullMAC-tools/Examples/STM32/uart_cli/Src/lwip_param.c
/**************************************************************************//**
 * Copyright 2019, Silicon Laboratories Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *****************************************************************************/

#include "app_version.h"
#include "lwip_common.h"
#include "sl_wfx_cli_common.h"
#include "dhcp_client.h"
#include "dhcp_server.h"
#include "ethernetif.h"
#include "lwip/ip_addr.h"
#include "lwip/dhcp.h"
#include "lwip/netif.h"

extern sl_wfx_context_t wifi;

static char target_name[] = "stm32f429";

#if SL_WFX_USE_SDIO
static char bus_name[] = "sdio";
#else
static char bus_name[] = "spi";
#endif

static const char *security_modes[] = {
  "OPEN",
  "WEP",
  "WPA1/WPA2",
  NULL,       // Trick to link directly the security mode to its "name".
  "WPA2"
};

static int set_security_mode (char *param_name,
                              void *param_addr,
                              char *new_value)
{
  sl_wfx_security_mode_t *mode = (sl_wfx_security_mode_t *)param_addr;
  int ret = -1;
  uint8_t i;

  (void)param_name;

  // Iterate through the security modes
  for (i=0; i<(sizeof(security_modes)/sizeof(char*)); i++) {
    if ((strncmp(new_value, security_modes[i], strlen(security_modes[i])) == 0)
        && (new_value[strlen(security_modes[i])] == '\0')) {

      // Security mode found
      *mode = (sl_wfx_security_mode_t)i;
      ret = 0;
      break;
    }
  }

  return ret;
}

static int get_security_mode (char *param_name,
                              void *param_addr,
                              char *output_buf,
                              uint32_t output_buf_len)
{
  int ret = -1;
  sl_wfx_security_mode_t mode = *(sl_wfx_security_mode_t *)param_addr;

  (void)param_name;

  if (mode < (sizeof(security_modes)/sizeof(char*))) {
    snprintf(output_buf, output_buf_len, "%s\r\n", (char *)security_modes[mode]);
    ret = 0;
  }

  return ret;
}

static int convert_str_to_ipv4 (char *ipv4, ip_addr_t *ip)
{
  uint8_t *ptr = (uint8_t *)(&(ip->addr));
  char buf[16] = {0}; //IP v4 max size
  int ret = -1;

  // Ensure the input size
  strncpy(buf, ipv4, sizeof(buf));
  buf[sizeof(buf)-1] = 0;

  // Extract the IP address
  // Should be "%hhu.%hhu.%hhu.%hhu" but it
  // doesn't work with nano LibC
  ret = sscanf(buf,
               "%hu.%hu.%hu.%hu",
               (short unsigned int *)&ptr[0],
               (short unsigned int *)&ptr[1],
               (short unsigned int *)&ptr[2],
               (short unsigned int *)&ptr[3]);
  if (ret == 4) {
    // Success, 4 numbers have been extracted
    ret = 0;
  }

  return ret;
}

static int convert_ipv4_to_str (ip_addr_t ip,
                                char *output_buf,
                                uint32_t output_buf_len)
{
  uint8_t *ptr = (uint8_t *)&ip.addr;

  snprintf(output_buf,
           output_buf_len,
           "%d.%d.%d.%d\r\n",
           ptr[0], ptr[1], ptr[2], ptr[3]);

  return 0;
}

static int set_netif_netmask (char *param_name,
                              void *param_addr,
                              char *new_value)
{
  struct netif *netif = (struct netif *)param_addr;
  ip_addr_t new_ip;
  int ret;

  (void)param_name;

  // Convert the IP address
  ret = convert_str_to_ipv4(new_value, &new_ip);
  if (ret == 0) {
    // Update the interface's netmask address
    netif_set_netmask(netif, &new_ip);
  }

  return ret;
}

static int get_netif_netmask (char *param_name,
                              void *param_addr,
                              char *output_buf,
                              uint32_t output_buf_len)
{
  struct netif *netif = (struct netif *)param_addr;

  (void)param_name;

  return convert_ipv4_to_str(netif->netmask, output_buf, output_buf_len);
}

static int set_netif_gateway (char *param_name,
                              void *param_addr,
                              char *new_value)
{
  struct netif *netif = (struct netif *)param_addr;
  ip_addr_t new_ip;
  int ret;

  (void)param_name;

  // Convert the IP address
  ret = convert_str_to_ipv4(new_value, &new_ip);
  if (ret == 0) {
    // Update the interface's gateway address
    netif_set_gw(netif, &new_ip);
  }

  return ret;
}

static int get_netif_gateway (char *param_name,
                              void *param_addr,
                              char *output_buf,
                              uint32_t output_buf_len)
{
  struct netif *netif = (struct netif *)param_addr;

  (void)param_name;

  return convert_ipv4_to_str(netif->gw, output_buf, output_buf_len);
}

static int set_netif_ipaddr (char *param_name,
                             void *param_addr,
                             char *new_value)
{
  struct netif *netif = (struct netif *)param_addr;
  ip_addr_t new_ip;
  int ret;

  (void)param_name;

  // Convert the IP address
  ret = convert_str_to_ipv4(new_value, &new_ip);
  if (ret == 0) {
    // Update the interface's IP address
    netif_set_ipaddr(netif, &new_ip);
  }

  return ret;
}

static int get_netif_ipaddr (char *param_name,
                             void *param_addr,
                             char *output_buf,
                             uint32_t output_buf_len)
{
  struct netif *netif = (struct netif *)param_addr;

  (void)param_name;

  return convert_ipv4_to_str(netif->ip_addr, output_buf, output_buf_len);
}

static int set_dhcp_client_state (char *param_name,
                                  void *param_addr,
                                  char *new_value)
{
  ip_addr_t sta_ipaddr, sta_netmask, sta_gw;
  int res;

  (void)param_name;
  (void)param_addr;

  // To limit undefined behaviors and ease the development
  // only accept a DHCP state change while the WLAN interface is down.
  if ((wifi.state & SL_WFX_STA_INTERFACE_CONNECTED) == 0) {
    // Update the DHCP client indicator
    use_dhcp_client = !!atoi(new_value);

    if (use_dhcp_client == 0) {
      // Disable the DHCP requests
      dhcpclient_set_link_state(0);

        // Restore default static addresses
        IP_ADDR4(&sta_ipaddr, sta_ip_addr0, sta_ip_addr1, sta_ip_addr2, sta_ip_addr3);
        IP_ADDR4(&sta_netmask, sta_netmask_addr0, sta_netmask_addr1, sta_netmask_addr2, sta_netmask_addr3);
        IP_ADDR4(&sta_gw, sta_gw_addr0, sta_gw_addr1, sta_gw_addr2, sta_gw_addr3);
        netif_set_addr(&sta_netif, &sta_ipaddr, &sta_netmask, &sta_gw);
    } else {
        // Clear current address
        netif_set_addr(&sta_netif, NULL, NULL, NULL);
        // Let the connect event enable the DHCP requests
    }

    res = 0;
  } else {
    printf("Operation denied: stop WLAN first\r\n");
    res = -1;
  }

  return res;
}

static int get_dhcp_client_state (char *param_name,
                                  void *param_addr,
                                  char *output_buf,
                                  uint32_t output_buf_len)
{
  (void)param_name;
  (void)param_addr;

  snprintf(output_buf, output_buf_len,  "%u\r\n", use_dhcp_client);

