SiliconLabs/wfx-fullMAC-tools/Examples/STM32/uart_cli/Src/lwip_param.c
  return 0;
}

static int set_dhcp_server_state (char *param_name,
                                  void *param_addr,
                                  char *new_value)
{
  int res;

  (void)param_name;
  (void)param_addr;

  // No known issues but limit this update for consistency with the DHCP client.
  if ((wifi.state & SL_WFX_AP_INTERFACE_UP) == 0) {
    use_dhcp_server = !!atoi(new_value);

    if ((use_dhcp_server == 0)
        && dhcpserver_is_started()) {
      dhcpserver_stop();
    } //else let the SoftAP start configure the DHCP server
    
    res = 0;
  } else {
    printf("Operation denied: stop SoftAP first\r\n");
    res = -1;
  }

  return res;
}

static int get_dhcp_server_state (char *param_name,
                                  void *param_addr,
                                  char *output_buf,
                                  uint32_t output_buf_len)
{
  (void)param_name;
  (void)param_addr;

  snprintf(output_buf, output_buf_len, "%u\r\n", use_dhcp_server);

  return 0;
}

static int get_station_pmk (char *param_name,
                            void *param_addr,
                            char *output_buf,
                            uint32_t output_buf_len)
{
  uint32_t password_length;
  sl_status_t status;

  (void)param_name;
  (void)param_addr;

  status = sl_wfx_get_pmk((uint8_t *)wlan_pmk, &password_length, SL_WFX_STA_INTERFACE);

  if (status != SL_STATUS_OK) {
    // Error, output an empty line
    wlan_pmk[0] = '\0';
  }

  snprintf(output_buf, output_buf_len, "%s\r\n", wlan_pmk);

  return 0;
}

static int get_softap_pmk (char *param_name,
                           void *param_addr,
                           char *output_buf,
                           uint32_t output_buf_len)
{
  uint32_t password_length;
  sl_status_t status;

  (void)param_name;
  (void)param_addr;

  status = sl_wfx_get_pmk((uint8_t *)softap_pmk, &password_length, SL_WFX_SOFTAP_INTERFACE);

  if (status != SL_STATUS_OK) {
    // Error, output an empty line
    softap_pmk[0] = '\0';
  }

  snprintf(output_buf, output_buf_len, "%s\r\n", softap_pmk);

  return 0;
}

static int set_mac_addr (char *param_name,
                         void *param_addr,
                         char *new_value)
{
  netif_init_fn netif_init;
  struct netif *netif;
  sl_wfx_interface_t interface;
  sl_wfx_mac_address_t new_mac;
  char buf[18] = {0}; // Mac address size
  int ret;

  // Ensure the input size
  strncpy(buf, new_value, sizeof(buf));
  buf[sizeof(buf)-1] = 0;

  // Extract the IP address
  // Should be "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx" but it
  // doesn't work with the nano LibC
  ret = sscanf(buf,
               "%02hx:%02hx:%02hx:%02hx:%02hx:%02hx",
               (short unsigned int *)&new_mac.octet[0],
               (short unsigned int *)&new_mac.octet[1],
               (short unsigned int *)&new_mac.octet[2],
               (short unsigned int *)&new_mac.octet[3],
               (short unsigned int *)&new_mac.octet[4],
               (short unsigned int *)&new_mac.octet[5]);
  if (ret == 6) {
    // Success, 6 numbers have been extracted

    // Check which interface it is
    if ((uint8_t *)param_addr == &wifi.mac_addr_0.octet[0]) {
      interface = SL_WFX_STA_INTERFACE;
      netif_init = sta_ethernetif_init;
      netif = &sta_netif;
    } else {
      interface = SL_WFX_SOFTAP_INTERFACE;
      netif_init = ap_ethernetif_init;
      netif = &ap_netif;
    }

    // Apply the new mac address
    ret = (int)sl_wfx_set_mac_address(&new_mac, interface);
    if (ret == 0) {
      // Update the parameter wit the new mac address
      memcpy(param_addr, new_mac.octet, sizeof(new_mac.octet));
      // Update the LwIP stack state
      ret = netif_init(netif);
    }
  } else {
    // Parsing error
    ret = -1;
  }

  return ret;
}

static int get_mac_addr (char *param_name,
                         void *param_addr,
                         char *output_buf,
                         uint32_t output_buf_len)
{
  uint8_t *mac = (uint8_t *)param_addr;

  snprintf(output_buf,
           output_buf_len,
           "%02X:%02X:%02X:%02X:%02X:%02X\r\n",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

  return 0;
}

static int get_wifi_state (char *param_name,
                           void *param_addr,
                           char *output_buf,
                           uint32_t output_buf_len)
{
  (void)param_name;
  (void)param_addr;

  if ((wifi.state & SL_WFX_STARTED) == SL_WFX_STARTED) {
    snprintf(output_buf,
             output_buf_len,
             "WiFi chip started:\r\n\tSTA: %sconnected\r\n\tAP:  %sstarted\r\n\tPS:  %sactive",
             wifi.state & SL_WFX_STA_INTERFACE_CONNECTED ? "" : "not ",
             wifi.state & SL_WFX_AP_INTERFACE_UP ? "" : "not ",
             wifi.state & SL_WFX_POWER_SAVE_ACTIVE ? "" : "in");

    if ((wifi.state & SL_WFX_POWER_SAVE_ACTIVE) == SL_WFX_POWER_SAVE_ACTIVE) {
      snprintf(output_buf,
               output_buf_len,
               "%s(%s)\r\n",
               output_buf,
               wifi.state & SL_WFX_SLEEPING ? "sleeping" : "awake");
    } else if ((strlen(output_buf) + 2) <= output_buf_len) {
      strcat(output_buf, "\r\n");
    }
  } else {
    strncpy(output_buf, "WiFi chip not started\r\n", output_buf_len);
  }

  return 0;
}

static int get_app_version (char *param_name,
                            void *param_addr,
                            char *output_buf,
                            uint32_t output_buf_len)
{
  (void)param_name;
  (void)param_addr;

  snprintf(output_buf,
           output_buf_len,
           "%u.%u.%u\r\n",
           WFX_UART_CLI_APP_VERSION_MAJOR,
           WFX_UART_CLI_APP_VERSION_MINOR,
           WFX_UART_CLI_APP_VERSION_BUILD);

  return 0;
}

static int get_driver_version (char *param_name,
                               void *param_addr,
                               char *output_buf,
                               uint32_t output_buf_len)
{
  (void)param_name;
  (void)param_addr;

