SiliconLabs/wfx-fullMAC-tools/Examples/STM32/uart_cli/Src/lwip_param.c
  snprintf(output_buf, output_buf_len, "%s\r\n", FMAC_DRIVER_VERSION_STRING);

  return 0;
}

static int get_firmware_version (char *param_name,
                                 void *param_addr,
                                 char *output_buf,
                                 uint32_t output_buf_len)
{
  (void)param_name;
  (void)param_addr;

  snprintf(output_buf,
           output_buf_len,
           "%u.%u.%u\r\n",
           wifi.firmware_major, wifi.firmware_minor, wifi.firmware_build);

  return 0;
}

static int get_target (char *param_name,
                       void *param_addr,
                       char *output_buf,
                       uint32_t output_buf_len)
{
  (void)param_name;
  (void)param_addr;

  snprintf(output_buf, output_buf_len, "%s\r\n", target_name);

  return 0;
}

static int get_bus_wifi (char *param_name,
                         void *param_addr,
                         char *output_buf,
                         uint32_t output_buf_len)
{
  (void)param_name;
  (void)param_addr;

  snprintf(output_buf, output_buf_len, "%s\r\n", bus_name);

  return 0;
}


int lwip_param_register (void)
{
  int ret;

  ret  = sl_wfx_cli_param_register("version_app",
                                   NULL,
                                   0,
                                   SL_WFX_CLI_PARAM_GET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "App version",
                                   get_app_version,
                                   NULL);

  ret |= sl_wfx_cli_param_register("version_drv",
                                   NULL,
                                   0,
                                   SL_WFX_CLI_PARAM_GET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "WFX Driver version",
                                   get_driver_version,
                                   NULL);

  ret |= sl_wfx_cli_param_register("version_fw",
                                   NULL,
                                   0,
                                   SL_WFX_CLI_PARAM_GET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "WFX Firmware version",
                                   get_firmware_version,
                                   NULL);

  ret |= sl_wfx_cli_param_register("target",
                                   NULL,
                                   0,
                                   SL_WFX_CLI_PARAM_GET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "Target running the application",
                                   get_target,
                                   NULL);

  ret |= sl_wfx_cli_param_register("wifi_bus",
                                   NULL,
                                   0,
                                   SL_WFX_CLI_PARAM_GET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "Bus to use between the WiFi chip and the host",
                                   get_bus_wifi,
                                   NULL);

  ret |= sl_wfx_cli_param_register("wifi_state",
                                   (void *)&wifi.state,
                                   sizeof(wifi.state),
                                   SL_WFX_CLI_PARAM_GET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "WiFi chip state",
                                   get_wifi_state,
                                   NULL);

  ret |= sl_wfx_cli_param_register("wlan.ssid",
                                   (void *)&wlan_ssid[0],
                                   sizeof(wlan_ssid),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_STRING,
                                   "WLAN SSID (max length 32 bytes)",
                                   NULL,
                                   NULL);

  ret |= sl_wfx_cli_param_register("wlan.passkey",
                                   (void *)&wlan_passkey[0],
                                   sizeof(wlan_passkey),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_STRING,
                                   "WLAN passkey  (max length 64 bytes)",
                                   NULL,
                                   NULL);

  ret |= sl_wfx_cli_param_register("wlan.security",
                                   (void *)&wlan_security,
                                   sizeof(wlan_security),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "WLAN security mode [OPEN, WEP, WPA1/WPA2, WPA2]",
                                   get_security_mode,
                                   set_security_mode);

  ret |= sl_wfx_cli_param_register("wlan.dhcpc_state",
                                   (void *)&use_dhcp_client,
                                   sizeof(use_dhcp_client),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "WLAN DHCP client state [0 (OFF), 1 (ON)]",
                                   get_dhcp_client_state,
                                   set_dhcp_client_state);

  ret |= sl_wfx_cli_param_register("wlan.netmask",
                                   (void *)&sta_netif,
                                   sizeof(sta_netif.netmask),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "WLAN network mask (IPv4 format)",
                                   get_netif_netmask,
                                   set_netif_netmask);

