SiliconLabs/wfx-fullMAC-tools/Examples/STM32/uart_cli/Src/lwip_param.c
  ret |= sl_wfx_cli_param_register("wlan.gateway",
                                   (void *)&sta_netif,
                                   sizeof(sta_netif.gw),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "WLAN gateway IP address (IPv4 format)",
                                   get_netif_gateway,
                                   set_netif_gateway);

  ret |= sl_wfx_cli_param_register("wlan.ip",
                                   (void *)&sta_netif,
                                   sizeof(sta_netif.ip_addr),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "WLAN IP address  (IPv4 format)",
                                   get_netif_ipaddr,
                                   set_netif_ipaddr);

  ret |= sl_wfx_cli_param_register("wlan.pmk",
                                   (void *)&wlan_pmk,
                                   sizeof(wlan_pmk),
                                   SL_WFX_CLI_PARAM_GET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "WLAN pairwise master key",
                                   get_station_pmk,
                                   NULL);

  ret |= sl_wfx_cli_param_register("wlan.mac",
                                   (void *)&wifi.mac_addr_0.octet,
                                   sizeof(wifi.mac_addr_0.octet),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "WLAN mac address (EUI-48 format)",
                                   get_mac_addr,
                                   set_mac_addr);

  ret |= sl_wfx_cli_param_register("softap.ssid",
                                   (void *)&softap_ssid[0],
                                   sizeof(softap_ssid),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_STRING,
                                   "SoftAP SSID  (max length 32 bytes)",
                                   NULL,
                                   NULL);

  ret |= sl_wfx_cli_param_register("softap.passkey",
                                   (void *)&softap_passkey[0],
                                   sizeof(softap_passkey),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_STRING,
                                   "SoftAP passkey  (max length 64 bytes)",
                                   NULL,
                                   NULL);

  ret |= sl_wfx_cli_param_register("softap.security",
                                   (void *)&softap_security,
                                   sizeof(softap_security),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "SoftAP security mode [OPEN, WEP, WPA1/WPA2, WPA2]",
                                   get_security_mode,
                                   set_security_mode);

  ret |= sl_wfx_cli_param_register("softap.channel",
                                   (void *)&softap_channel,
                                   sizeof(softap_channel),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_UNSIGNED_INTEGER,
                                   "SoftAP channel (decimal)",
                                   NULL,
                                   NULL);

  ret |= sl_wfx_cli_param_register("softap.netmask",
                                   (void *)&ap_netif,
                                   sizeof(ap_netif.netmask),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "SoftAP network mask (IPv4 format)",
                                   get_netif_netmask,
                                   set_netif_netmask);

  ret |= sl_wfx_cli_param_register("softap.gateway",
                                   (void *)&ap_netif,
                                   sizeof(ap_netif.gw),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "SoftAP gateway IP address (IPv4 format)",
                                   get_netif_gateway,
                                   set_netif_gateway);

  ret |= sl_wfx_cli_param_register("softap.ip",
                                   (void *)&ap_netif,
                                   sizeof(ap_netif.ip_addr),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "SoftAP IP address (IPv4 format)",
                                   get_netif_ipaddr,
                                   set_netif_ipaddr);

  ret |= sl_wfx_cli_param_register("softap.pmk",
                                   (void *)&softap_pmk,
                                   sizeof(softap_pmk),
                                   SL_WFX_CLI_PARAM_GET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "SoftAP pairwise master key",
                                   get_softap_pmk,
                                   NULL);

  ret |= sl_wfx_cli_param_register("softap.mac",
                                   (void *)&wifi.mac_addr_1.octet,
                                   sizeof(wifi.mac_addr_1.octet),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "SoftAP mac address (EUI-48 format)",
                                   get_mac_addr,
                                   set_mac_addr);

  ret |= sl_wfx_cli_param_register("softap.dhcps_state",
                                   (void *)&use_dhcp_server,
                                   sizeof(use_dhcp_server),
                                   SL_WFX_CLI_PARAM_GET_RIGHT | SL_WFX_CLI_PARAM_SET_RIGHT,
                                   SL_WFX_CLI_PARAM_TYPE_CUSTOM,
                                   "SoftAP DHCP server state [0 (OFF), 1 (ON)]",
                                   get_dhcp_server_state,
                                   set_dhcp_server_state);

  return ret;
}

